Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ1025DAG169.PIC
      <edc:SFRDef edc:_addr="0x1F860450" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPUE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="CNPUE" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUE0" edc:desc="" edc:mask="0x1" edc:name="CNPUE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE1" edc:desc="" edc:mask="0x1" edc:name="CNPUE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE2" edc:desc="" edc:mask="0x1" edc:name="CNPUE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE3" edc:desc="" edc:mask="0x1" edc:name="CNPUE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE4" edc:desc="" edc:mask="0x1" edc:name="CNPUE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE5" edc:desc="" edc:mask="0x1" edc:name="CNPUE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE6" edc:desc="" edc:mask="0x1" edc:name="CNPUE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE7" edc:desc="" edc:mask="0x1" edc:name="CNPUE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE8" edc:desc="" edc:mask="0x1" edc:name="CNPUE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUE9" edc:desc="" edc:mask="0x1" edc:name="CNPUE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860460" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNPDE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="CNPDE" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDE0" edc:desc="" edc:mask="0x1" edc:name="CNPDE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE1" edc:desc="" edc:mask="0x1" edc:name="CNPDE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE2" edc:desc="" edc:mask="0x1" edc:name="CNPDE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE3" edc:desc="" edc:mask="0x1" edc:name="CNPDE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE4" edc:desc="" edc:mask="0x1" edc:name="CNPDE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE5" edc:desc="" edc:mask="0x1" edc:name="CNPDE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE6" edc:desc="" edc:mask="0x1" edc:name="CNPDE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE7" edc:desc="" edc:mask="0x1" edc:name="CNPDE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE8" edc:desc="" edc:mask="0x1" edc:name="CNPDE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDE9" edc:desc="" edc:mask="0x1" edc:name="CNPDE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860470" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------n---n-----------" edc:cname="CNCONE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONE" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE E" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860480" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNENE" edc:desc="" edc:grp="PORTE" edc:impl="0xffc003ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="CNENE" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEE0" edc:desc="" edc:mask="0x1" edc:name="CNIEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE1" edc:desc="" edc:mask="0x1" edc:name="CNIEE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE2" edc:desc="" edc:mask="0x1" edc:name="CNIEE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE3" edc:desc="" edc:mask="0x1" edc:name="CNIEE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE4" edc:desc="" edc:mask="0x1" edc:name="CNIEE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE5" edc:desc="" edc:mask="0x1" edc:name="CNIEE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE6" edc:desc="" edc:mask="0x1" edc:name="CNIEE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE7" edc:desc="" edc:mask="0x1" edc:name="CNIEE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE8" edc:desc="" edc:mask="0x1" edc:name="CNIEE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEE9" edc:desc="" edc:mask="0x1" edc:name="CNIEE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860490" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNSTATE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="CNSTATE" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATE0" edc:desc="" edc:mask="0x1" edc:name="CNSTATE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE1" edc:desc="" edc:mask="0x1" edc:name="CNSTATE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE2" edc:desc="" edc:mask="0x1" edc:name="CNSTATE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE3" edc:desc="" edc:mask="0x1" edc:name="CNSTATE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE4" edc:desc="" edc:mask="0x1" edc:name="CNSTATE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE5" edc:desc="" edc:mask="0x1" edc:name="CNSTATE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE6" edc:desc="" edc:mask="0x1" edc:name="CNSTATE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE7" edc:desc="" edc:mask="0x1" edc:name="CNSTATE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE8" edc:desc="" edc:mask="0x1" edc:name="CNSTATE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATE9" edc:desc="" edc:mask="0x1" edc:name="CNSTATE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNNEE" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="CNNEE" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEE0" edc:mask="0x1" edc:name="CNNEE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE1" edc:mask="0x1" edc:name="CNNEE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE2" edc:mask="0x1" edc:name="CNNEE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE3" edc:mask="0x1" edc:name="CNNEE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE4" edc:mask="0x1" edc:name="CNNEE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE5" edc:mask="0x1" edc:name="CNNEE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE6" edc:mask="0x1" edc:name="CNNEE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE7" edc:mask="0x1" edc:name="CNNEE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE8" edc:mask="0x1" edc:name="CNNEE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEE9" edc:mask="0x1" edc:name="CNNEE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="CNFE" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="CNFE" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFE0" edc:mask="0x1" edc:name="CNFE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE1" edc:mask="0x1" edc:name="CNFE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE2" edc:mask="0x1" edc:name="CNFE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE3" edc:mask="0x1" edc:name="CNFE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE4" edc:mask="0x1" edc:name="CNFE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE5" edc:mask="0x1" edc:name="CNFE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE6" edc:mask="0x1" edc:name="CNFE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE7" edc:mask="0x1" edc:name="CNFE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE8" edc:mask="0x1" edc:name="CNFE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFE9" edc:mask="0x1" edc:name="CNFE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="SRCON0E" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="SRCON0E" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0E0" edc:mask="0x1" edc:name="SR0E0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0E1" edc:mask="0x1" edc:name="SR0E1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E2" edc:mask="0x1" edc:name="SR0E2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E3" edc:mask="0x1" edc:name="SR0E3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E4" edc:mask="0x1" edc:name="SR0E4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E5" edc:mask="0x1" edc:name="SR0E5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E6" edc:mask="0x1" edc:name="SR0E6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E7" edc:mask="0x1" edc:name="SR0E7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E8" edc:mask="0x1" edc:name="SR0E8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0E9" edc:mask="0x1" edc:name="SR0E9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8604D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnnnnnnnn" edc:cname="SRCON1E" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="SRCON1E" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1E0" edc:mask="0x1" edc:name="SR1E0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E1" edc:mask="0x1" edc:name="SR1E1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E2" edc:mask="0x1" edc:name="SR1E2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E3" edc:mask="0x1" edc:name="SR1E3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E4" edc:mask="0x1" edc:name="SR1E4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E5" edc:mask="0x1" edc:name="SR1E5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E6" edc:mask="0x1" edc:name="SR1E6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E7" edc:mask="0x1" edc:name="SR1E7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E8" edc:mask="0x1" edc:name="SR1E8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1E9" edc:mask="0x1" edc:name="SR1E9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
