Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ1025DAG169.PIC
      <edc:SFRDef edc:_addr="0x1F882150" edc:_begin="0x100" edc:_end="0x170" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHFCSERR" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHFCSERR" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FCSERRCNT" edc:desc="" edc:mask="0xffff" edc:name="FCSERRCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882160" edc:_begin="0x100" edc:_end="0x170" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHALGNERR" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHALGNERR" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALGNERRCNT" edc:desc="" edc:mask="0xffff" edc:name="ALGNERRCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F882170" edc:offset="144"/>
      <edc:SFRDef edc:_addr="0x1F882200" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="----------------nn--nnnn---nnnnn" edc:cname="EMAC1CFG1" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx10xx0000xxx01101" edc:name="EMAC1CFG1" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx10xx0000xxx01101" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxCFG1"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXENABLE" edc:desc="" edc:mask="0x1" edc:name="RXENABLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PASSALL" edc:desc="" edc:mask="0x1" edc:name="PASSALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXPAUSE" edc:desc="" edc:mask="0x1" edc:name="RXPAUSE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXPAUSE" edc:desc="" edc:mask="0x1" edc:name="TXPAUSE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOOPBACK" edc:desc="" edc:mask="0x1" edc:name="LOOPBACK" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RESETTFUN" edc:desc="" edc:mask="0x1" edc:name="RESETTFUN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESETTMCS" edc:desc="" edc:mask="0x1" edc:name="RESETTMCS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESETRFUN" edc:desc="" edc:mask="0x1" edc:name="RESETRFUN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESETRMCS" edc:desc="" edc:mask="0x1" edc:name="RESETRMCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SIMRESET" edc:desc="" edc:mask="0x1" edc:name="SIMRESET" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOFTRESET" edc:desc="" edc:mask="0x1" edc:name="SOFTRESET" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882210" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="-----------------nnn--nnnnnnnnnn" edc:cname="EMAC1CFG2" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxx100xx0010110100" edc:name="EMAC1CFG2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxx100xx0010110100" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxCFG2"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FULLDPLX" edc:desc="" edc:mask="0x1" edc:name="FULLDPLX" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LENGTHCK" edc:desc="" edc:mask="0x1" edc:name="LENGTHCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HUGEFRM" edc:desc="" edc:mask="0x1" edc:name="HUGEFRM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DELAYCRC" edc:desc="" edc:mask="0x1" edc:name="DELAYCRC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCENABLE" edc:desc="" edc:mask="0x1" edc:name="CRCENABLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PADENABLE" edc:desc="" edc:mask="0x1" edc:name="PADENABLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANPAD" edc:desc="" edc:mask="0x1" edc:name="VLANPAD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOPAD" edc:desc="" edc:mask="0x1" edc:name="AUTOPAD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUREPRE" edc:desc="" edc:mask="0x1" edc:name="PUREPRE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LONGPRE" edc:desc="" edc:mask="0x1" edc:name="LONGPRE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="NOBKOFF" edc:desc="" edc:mask="0x1" edc:name="NOBKOFF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPNOBKOFF" edc:desc="" edc:mask="0x1" edc:name="BPNOBKOFF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXCESSDFR" edc:desc="" edc:mask="0x1" edc:name="EXCESSDFR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882220" edc:_begin="0x200" edc:_end="0x2e0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="3" edc:access="-------------------------nnnnnnn" edc:cname="EMAC1IPGT" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxx0010010" edc:name="EMAC1IPGT" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxx0010010" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxIPGT"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="B2BIPKTGP" edc:desc="" edc:mask="0x7f" edc:name="B2BIPKTGP" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
