Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ1025DAG169.PIC
      <edc:SFRDef edc:_addr="0x1F8E3364" edc:_begin="0x360" edc:_end="0x368" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="17" edc:access="-----------------nnnnnnn--nnnnnn" edc:cname="USBLMPR2" edc:desc="" edc:impl="0x7f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------0000000--000000" edc:name="USBLPMR2" edc:nzwidth="32" edc:por="-----------------0000000--000000" ltx:memberofperipheral="USB">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="USBLPMP2"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LPMST" edc:desc="" edc:mask="0x1" edc:name="LPMST" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMNY" edc:desc="" edc:mask="0x1" edc:name="LPMNY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMACK" edc:desc="" edc:mask="0x1" edc:name="LPMACK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMNC" edc:desc="" edc:mask="0x1" edc:name="LPMNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMRES" edc:desc="" edc:mask="0x1" edc:name="LPMRES" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LPMERR" edc:desc="" edc:mask="0x1" edc:name="LPMERR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="LPMFADDR" edc:desc="" edc:mask="0x7f" edc:name="LPMFADDR" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3368" edc:offset="11416"/>
      <edc:SFRDef edc:_addr="0x1F8E6000" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGVER" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGVER" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:baseofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="" edc:mask="0x7f" edc:name="REVISION" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="" edc:mask="0x1ff" edc:name="VERSION" edc:nzwidth="9"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="" edc:mask="0xffff" edc:name="ID" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6004" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="-------------------n-nnnnnnnnnnn" edc:cname="RNGCON" edc:desc="" edc:impl="0x17ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0-00001000000" edc:name="RNGCON" edc:nzwidth="32" edc:por="-------------------0-00001000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xff" edc:name="PLEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="TRNGEN" edc:desc="" edc:mask="0x1" edc:name="TRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRNGEN" edc:desc="" edc:mask="0x1" edc:name="PRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CONT" edc:desc="" edc:mask="0x1" edc:name="CONT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRNGMODE" edc:desc="" edc:mask="0x1" edc:name="TRNGMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="" edc:mask="0x1" edc:name="LOAD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6008" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY1" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E600C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY2" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6010" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN1" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6014" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN2" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6018" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
