Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ1025DAG169.PIC
      <edc:SFRDef edc:_addr="0x1F8E8044" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="n---nnnn----nnnn--------nnnnnnnn" edc:cname="DDRXFERCFG" edc:desc="" edc:impl="0x8f0f00ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000----0000--------00000000" edc:name="DDRXFERCFG" edc:nzwidth="32" edc:por="0---0000----0000--------00000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NXTDATRQDLY" edc:desc="" edc:mask="0xf" edc:name="NXTDATRQDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="NXTDATAVDLY" edc:desc="" edc:mask="0xf" edc:name="NXTDATAVDLY" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="RDATENDLY" edc:desc="" edc:mask="0xf" edc:name="RDATENDLY" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="MAXBURST" edc:desc="" edc:mask="0xf" edc:name="MAXBURST" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="BIGENDIAN" edc:desc="" edc:mask="0x1" edc:name="BIGENDIAN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8048" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="DDRCMDISSUE" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="DDRCMDISSUE" edc:nzwidth="32" edc:por="---------------------------00000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NUMHOSTCMDS" edc:desc="" edc:mask="0xf" edc:name="NUMHOSTCMDS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="" edc:mask="0x1" edc:name="NXTDATAVDLY" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E804C" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="---------------n---------------n" edc:cname="DDRODTENCFG" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0---------------0" edc:name="DDRODTENCFG" edc:nzwidth="32" edc:por="---------------0---------------0" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODTREN" edc:desc="" edc:mask="0x1" edc:name="ODTREN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="ODTWEN" edc:desc="" edc:mask="0x1" edc:name="ODTWEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8050" edc:_begin="0x0" edc:_end="0x54" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="1" edc:access="----------------------------n---" edc:cname="DDRMEMWIDTH" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0---" edc:name="DDRMEMWIDTH" edc:nzwidth="32" edc:por="----------------------------0---" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="HALFRATE" edc:desc="" edc:mask="0x1" edc:name="HALFRATE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E8054" edc:offset="0x2c"/>
      <edc:SFRDef edc:_addr="0x1F8E8080" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD10" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD10" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8084" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="3" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD11" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD11" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8088" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD12" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD12" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E808C" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD13" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD13" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8090" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD14" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD14" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8094" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="7" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD15" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD15" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E8098" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD16" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD16" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
